УНФ_ТЕСТ/src/InformationRegisters/КП_ИсполнителиРолей/КП_ИсполнителиРолей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КП_ИсполнителиРолей</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <attributes>
    <name>ДопГруппаДоступаИсполнителей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.КП_РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/InformationRegisters/КП_ИсполнителиРолей/ManagerModule.bsl
// _Демо начало (подсистема "Управление доступом")

Функция ГруппаДоступаИсполнителей(РольИсполнителя, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопГруппыДоступаИсполнителей.Ссылка
	|ИЗ
	|	Справочник.ДопГруппыДоступаИсполнителей КАК ДопГруппыДоступаИсполнителей
	|ГДЕ
	|	ДопГруппыДоступаИсполнителей.РольИсполнителя = &РольИсполнителя
	|	И ДопГруппыДоступаИсполнителей.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации
	|	И ДопГруппыДоступаИсполнителей.ДополнительныйОбъектАдресации = &ДополнительныйОбъектАдресации");
	Запрос.УстановитьПараметр("РольИсполнителя",               РольИсполнителя);
	Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",       ОсновнойОбъектАдресации);
	Запрос.УстановитьПараметр("ДополнительныйОбъектАдресации", ДополнительныйОбъектАдресации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ГруппаИсполнителей = Выборка.Ссылка;
	Иначе
		// Требуется добавить новую группу исполнителей.
		ГруппаИсполнителейОбъект = Справочники.ДопГруппыДоступаИсполнителей.СоздатьЭлемент();
		ГруппаИсполнителейОбъект.РольИсполнителя               = РольИсполнителя;
		ГруппаИсполнителейОбъект.ОсновнойОбъектАдресации       = ОсновнойОбъектАдресации;
		ГруппаИсполнителейОбъект.ДополнительныйОбъектАдресации = ДополнительныйОбъектАдресации;
		ГруппаИсполнителейОбъект.Записать();
		ГруппаИсполнителей = ГруппаИсполнителейОбъект.Ссылка;
	КонецЕсли;
	
	Возврат ГруппаИсполнителей;
	
КонецФункции // ГруппаДоступаИсполнителей()

// _Демо конец (подсистема "Управление доступом")
